In [1]:
import pandas as pd

In [2]:
data={"age":[12,54,17,93],
      "salary":[12222,99999,2324,222222],
      "loan approval":[1,0,1,1]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

   age  salary  loan approval
0   12   12222              1
1   54   99999              0
2   17    2324              1
3   93  222222              1

In [8]:
correlation=df.corr()
correlation

                    age    salary  loan approval
age            1.000000  0.992821      -0.177040
salary         0.992821  1.000000      -0.103361
loan approval -0.177040 -0.103361       1.000000

In [9]:
correlation=df.corr()["loan approval"]
correlation

age             -0.177040
salary          -0.103361
loan approval    1.000000
Name: loan approval, dtype: float64

In [10]:
correlation=correlation.abs()
correlation

age              0.177040
salary           0.103361
loan approval    1.000000
Name: loan approval, dtype: float64

In [14]:
df.drop(columns="age")

   salary  loan approval
0   12222              1
1   99999              0
2    2324              1
3  222222              1

In [15]:
df

   age  salary  loan approval
0   12   12222              1
1   54   99999              0
2   17    2324              1
3   93  222222              1

In [16]:
correlation

age              0.177040
salary           0.103361
loan approval    1.000000
Name: loan approval, dtype: float64

In [17]:
correlation.sort_values(ascending=False)

loan approval    1.000000
age              0.177040
salary           0.103361
Name: loan approval, dtype: float64